*************************************************
* FILENAME : CH01.asm
* AUTHOR : HYUK KIM
* SYSTEM : OFASM v4 revision 169
*************************************************
        MACRO
        MACRO_CH    &VALUE1,&VALUE2
        LG          2,&VALUE1
        OFADBGREG   2
        OFADBGMEM   &VALUE2,0
        CH          2,&VALUE2
        OFADBGREG   2
        OFADBGMEM   &VALUE2,0
        MEND
CH01    CSECT
        LR          12,15
        USING       CH01,12
* TESTCASE_215	0>	32bits	0>	16bits<	oprand1<oprand2
                MACRO_CH    DATA101_1,DATA101_2
* TESTCASE_216	0>	32bits	0>	16bits<	oprand1>oprand2
                MACRO_CH    DATA102_1,DATA102_2
* TESTCASE_218	0>	64bits	0	16bits>	oprand1<oprand2
                MACRO_CH    DATA103_1,DATA103_2
* TESTCASE_221	0>	64bits	0	16bits	oprand1<oprand2
                MACRO_CH    DATA104_1,DATA104_2
* TESTCASE_224	0>	64bits	0	16bits<	oprand1<oprand2
                MACRO_CH    DATA105_1,DATA105_2
* TESTCASE_227	0>	64bits	0<	16bits>	oprand1<oprand2
                MACRO_CH    DATA106_1,DATA106_2
* TESTCASE_230	0>	64bits	0<	16bits	oprand1<oprand2
                MACRO_CH    DATA107_1,DATA107_2
* TESTCASE_233	0>	64bits	0<	16bits<	oprand1<oprand2
                MACRO_CH    DATA108_1,DATA108_2
* TESTCASE_235	0>	64bits	0>	16bits>	oprand1=oprand2
                MACRO_CH    DATA109_1,DATA109_2
* TESTCASE_236	0>	64bits	0>	16bits>	oprand1<oprand2
                MACRO_CH    DATA110_1,DATA110_2
* TESTCASE_237	0>	64bits	0>	16bits>	oprand1>oprand2
                MACRO_CH    DATA111_1,DATA111_2
* TESTCASE_238	0>	64bits	0>	16bits	oprand1=oprand2
                MACRO_CH    DATA112_1,DATA112_2
* TESTCASE_239	0>	64bits	0>	16bits	oprand1<oprand2
                MACRO_CH    DATA113_1,DATA113_2
* TESTCASE_240	0>	64bits	0>	16bits	oprand1>oprand2
                MACRO_CH    DATA114_1,DATA114_2
* TESTCASE_241	0>	64bits	0>	16bits<	oprand1=oprand2
                MACRO_CH    DATA115_1,DATA115_2
* TESTCASE_242	0>	64bits	0>	16bits<	oprand1<oprand2
                MACRO_CH    DATA116_1,DATA116_2
* TESTCASE_243	0>	64bits	0>	16bits<	oprand1>oprand2
                MACRO_CH    DATA117_1,DATA117_2
        BR          14
DATA101_1 DC X'01234567F0123456'
DATA101_2 DC X'F0123456'
DATA102_1 DC X'01234567F0123456'
DATA102_2 DC X'F0123456'
DATA103_1 DC X'F0123456789ABCDE'
DATA103_2 DC X'00'
DATA103_TEMP DC X'FF'
DATA104_1 DC X'F0123456789ABCDE'
DATA104_2 DC X'0000'
DATA105_1 DC X'F0123456789ABCDE'
DATA105_2 DC X'00000000'
DATA106_1 DC X'F0123456789ABCDE'
DATA106_2 DC X'01'
DATA106_TEMP DC X'23'
DATA107_1 DC X'F0123456789ABCDE'
DATA107_2 DC X'0123'
DATA108_1 DC X'F0123456789ABCDE'
DATA108_2 DC X'01234567'
DATA109_1 DC X'F0123456789ABCDE'
DATA109_2 DC X'F0'
DATA109_TEMP DC X'12'
DATA110_1 DC X'F0123456789ABCDE'
DATA110_2 DC X'F0'
DATA110_TEMP DC X'12'
DATA111_1 DC X'F0123456789ABCDE'
DATA111_2 DC X'F0'
DATA111_TEMP DC X'12'
DATA112_1 DC X'F0123456789ABCDE'
DATA112_2 DC X'F012'
DATA113_1 DC X'F0123456789ABCDE'
DATA113_2 DC X'F012'
DATA114_1 DC X'F0123456789ABCDE'
DATA114_2 DC X'F012'
DATA115_1 DC X'F0123456789ABCDE'
DATA115_2 DC X'F0123456'
DATA116_1 DC X'F0123456789ABCDE'
DATA116_2 DC X'F0123456'
DATA117_1 DC X'F0123456789ABCDE'
DATA117_2 DC X'F0123456'
        END
