*************************************************
* FILENAME : MVO01.asm
* AUTHOR : HYUK KIM
* SYSTEM : OFASM v4 revision 169
*************************************************
                MACRO
                MACRO_MVO   &VALUE1,&VALUE2,&LEN1,&LEN2
                OFADBGMEM   &VALUE1,0
                OFADBGMEM   &VALUE2,0
                LA          2,&VALUE1
                LA          3,&VALUE2
                MVO         0(&LEN1,2),0(&LEN2,3)
                OFADBGMEM   &VALUE1,0
                OFADBGMEM   &VALUE2,0
                MEND
MVO01           CSECT
                LR          12,15
                USING       MVO01,12
* TESTCASE_1 invalid length	binary	invalid length	binary
                MACRO_MVO   DATA1_1,DATA1_2,DATA1_1_LEN,DATA1_2_LEN
* TESTCASE_2 invalid length	binary	valid length(1~16)	binary
                MACRO_MVO   DATA2_1,DATA2_2,DATA2_1_LEN,DATA2_2_LEN
* TESTCASE_3 valid length(1~16)	binary	invalid length	binary
*                MACRO_MVO   DATA3_1,DATA3_2,DATA3_1_LEN,DATA3_2_LEN
* TESTCASE_4 valid length(1~16)	binary	valid length(1~16)	binary
*                MACRO_MVO   DATA4_1,DATA4_2,DATA4_1_LEN,DATA4_2_LEN
                BR          14
DATA1_1 DC X'000111222333444555666777888999AAABBBCCCDDDEEEFFF'
DATA1_1_LEN EQU -1
DATA1_2 DC X'0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF'
DATA1_2_LEN EQU 17
DATA2_1 DC X'000111222333444555666777888999AAABBBCCCDDDEEEFFF'
DATA2_1_LEN EQU 17
DATA2_2 DC X'0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF'
DATA2_2_LEN EQU 16
DATA3_1 DC X'000111222333444555666777888999AAABBBCCCDDDEEEFFF'
DATA3_1_LEN EQU 4
DATA3_2 DC X'0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF'
DATA3_2_LEN EQU 3
DATA4_1 DC X'000111222333444555666777888999AAABBBCCCDDDEEEFFF'
DATA4_1_LEN EQU 3
DATA4_2 DC X'0123456789ABCDEF0123456789ABCDEF0123456789ABCDEF'
DATA4_2_LEN EQU 4

                END
