         TITLE 'COPXOR - EXCLUSIVE OR'                                          
***********************************************************************         
*        C O P  -  C A T A L O G   O R D E R   P R O C E S S I N G    *         
*                                                                     *         
*        E X C L U S I V E   O R                                      *         
*                                                                     *         
*        C O P X O R                                                  *         
*                                                                     *         
*---------------------------------------------------------------------*         
*        M A I N T E N A N C E   H I S T O R Y                        *         
*---------------------------------------------------------------------*         
*        WRITTEN: 11/12/04   AUTHOR: GARY JONES                       *         
***********************************************************************         
         SPACE                                                                  
COPXOR   AMODE ANY                                                              
COPXOR   RMODE ANY                                                              
COPXOR   SCENTER R13,TYPE=SUBROUTINE                                            
         SPACE                                                                  
         LM    R3,R5,0(R1)                                                      
         L     R1,0(R4)                                                         
         LTR   R1,R1                                                            
         BNP   ABND                                                             
         C     R1,=F'32'                                                        
         BH    ABND                                                             
         BCTR  R1,0                                                             
         USING PSA,0                                                            
         L     R7,FLCCVT                                                        
         USING CVT,R7                                                           
         CLC   CVTSNAME(3),=C'DEV'                                              
         BE    START                                                            
         L     R6,PSATOLD                                                       
         USING TCB,R6                                                           
         L     R6,TCBEXT2                                                       
         DROP  R6                                                               
         USING TCBXTNT2,R6                                                      
         L     R0,TCBCAUF                                                       
         LTR   R0,R0                                                            
         BNZ   START                                                            
         DROP  R6                                                               
         L     R6,PSAAOLD                                                       
         USING ASCB,R6                                                          
         L     R6,ASCBASXB                                                      
         DROP  R6                                                               
         USING ASXB,R6                                                          
         CLC   ASXBUSER,=C'PRDSCHD'                                             
         B     START                                                            
         BE    START                                                            
         WTO   'ATTEMPT TO USE CIPHER ROUTINE OUTSIDE PRODUCTION'               
         ABEND 444                                                              
START    EQU   *                                                                
         CLI   0(R5),C'E'                                                       
         BE    ENC                                                              
         CLI   0(R5),C'D'                                                       
         BE    DEC                                                              
         B     ABND                                                             
ENC      EQU   *                                                                
         EX    R1,XOR                                                           
         EX    R1,TRE                                                           
         B     EXIT                                                             
DEC      EQU   *                                                                
         CLC   CVTSNAME(3),=C'DEV'                                              
         BE    DECDEV                                                           
         EX    R1,TRD                                                           
         EX    R1,XOR                                                           
         B     EXIT                                                             
DECDEV   EQU   *                                                                
         C     R1,=F'15'                                                        
         BE    DECDEV16                                                         
         C     R1,=F'3'                                                         
         BE    DECDEV4                                                          
         EX    R1,DECSTAT                                                       
         B     EXIT                                                             
DECDEV16 EQU   *                                                                
         MVC   0(16,R3),=C'4111111111111111'                                    
         B     EXIT                                                             
DECDEV4  EQU   *                                                                
         MVC   0(4,R3),=C'1109'                                                 
         B     EXIT                                                             
         SPACE                                                                  
EXIT     EQU   *                                                                
         SCEXIT TYPE=SUBROUTINE                                                 
         SPACE                                                                  
XOR      XC    0(0,R3),XK                                                       
TRE      TR    0(0,R3),TE                                                       
TRD      TR    0(0,R3),TD                                                       
DECSTAT  MVC   0(0,R3),=C'00000000000000000000000000000000'                     
         SPACE                                                                  
ABND     DC    H'0'                                                             
         SPACE                                                                  
         LTORG                                                                  
         SPACE                                                                  
*                0 1 2 3 4 5 6 7 8 9 A B C D E F                                
XK       DC    X'1E4973582CD3BD5C7DE64C612843C254'                              
         DC    X'E86C45BEA2963CDEB33A769153CD194A'                              
         SPACE                                                                  
TE       DC    AL1(125,202,208,076,221,131,184,217)                             
         DC    AL1(243,016,087,193,152,020,001,145)                             
         DC    AL1(045,136,097,139,108,118,209,060)                             
         DC    AL1(179,103,021,180,162,055,156,117)                             
         DC    AL1(042,039,050,082,033,003,028,135)                             
         DC    AL1(214,192,041,034,102,144,151,015)                             
         DC    AL1(128,096,222,132,245,146,198,174)                             
         DC    AL1(201,171,158,237,073,138,175,007)                             
         DC    AL1(255,044,025,089,037,250,211,230)                             
         DC    AL1(114,210,213,134,079,249,188,231)                             
         DC    AL1(191,110,115,071,129,142,150,072)                             
         DC    AL1(251,011,012,154,009,048,254,063)                             
         DC    AL1(196,194,031,095,090,098,024,173)                             
         DC    AL1(130,051,164,253,140,141,227,182)                             
         DC    AL1(235,005,242,161,218,083,081,032)                             
         DC    AL1(004,133,084,002,077,014,120,166)                             
         DC    AL1(187,104,054,094,228,238,010,185)                             
         DC    AL1(065,244,085,122,059,183,019,240)                             
         DC    AL1(013,190,029,220,112,181,091,113)                             
         DC    AL1(040,056,099,159,038,143,226,107)                             
         DC    AL1(147,006,080,119,106,017,200,022)                             
         DC    AL1(069,109,176,225,124,121,036,165)                             
         DC    AL1(233,068,215,205,216,030,239,169)                             
         DC    AL1(203,170,157,137,241,204,236,035)                             
         DC    AL1(066,149,160,212,153,070,148,116)                             
         DC    AL1(000,223,195,105,008,053,234,252)                             
         DC    AL1(111,177,248,206,058,229,018,086)                             
         DC    AL1(067,163,074,047,057,123,207,232)                             
         DC    AL1(088,168,026,224,043,027,186,093)                             
         DC    AL1(061,178,075,062,247,064,101,155)                             
         DC    AL1(199,092,046,246,023,126,078,172)                             
         DC    AL1(197,049,167,100,052,127,189,219)                             
         SPACE                                                                  
TD       DC    AL1(200,014,123,037,120,113,161,063)                             
         DC    AL1(204,092,134,089,090,144,125,047)                             
         DC    AL1(009,165,214,142,013,026,167,244)                             
         DC    AL1(102,066,226,229,038,146,181,098)                             
         DC    AL1(119,036,043,191,174,068,156,033)                             
         DC    AL1(152,042,032,228,065,016,242,219)                             
         DC    AL1(093,249,034,105,252,205,130,029)                             
         DC    AL1(153,220,212,140,023,232,235,095)                             
         DC    AL1(237,136,192,216,177,168,197,083)                             
         DC    AL1(087,060,218,234,003,124,246,076)                             
         DC    AL1(162,118,035,117,122,138,215,010)                             
         DC    AL1(224,067,100,150,241,231,131,099)                             
         DC    AL1(049,018,101,154,251,238,044,025)                             
         DC    AL1(129,203,164,159,020,169,081,208)                             
         DC    AL1(148,151,072,082,199,031,021,163)                             
         DC    AL1(126,173,139,221,172,000,245,253)                             
         DC    AL1(048,084,104,005,051,121,075,039)                             
         DC    AL1(017,187,061,019,108,109,085,157)                             
         DC    AL1(045,015,053,160,198,193,086,046)                             
         DC    AL1(012,196,091,239,030,186,058,155)                             
         DC    AL1(194,115,028,217,106,175,127,250)                             
         DC    AL1(225,183,185,057,247,103,055,062)                             
         DC    AL1(170,209,233,024,027,149,111,141)                             
         DC    AL1(006,135,230,128,078,254,145,080)                             
         DC    AL1(041,011,097,202,096,248,054,240)                             
         DC    AL1(166,056,001,184,189,179,211,222)                             
         DC    AL1(002,022,073,070,195,074,040,178)                             
         DC    AL1(180,007,116,255,147,004,050,201)                             
         DC    AL1(227,171,158,110,132,213,071,079)                             
         DC    AL1(223,176,206,112,190,059,133,182)                             
         DC    AL1(143,188,114,008,137,052,243,236)                             
         DC    AL1(210,077,069,088,207,107,094,064)                             
WEND     EQU   *                                                                
         EJECT                                                                  
         IHAPSA DSECT=YES,LIST=YES                                              
         EJECT                                                                  
         CVT   DSECT=YES,LIST=YES                                               
         EJECT                                                                  
         IKJTCB DSECT=YES,LIST=YES                                              
         EJECT                                                                  
         IHAASCB DSECT=YES,LIST=YES                                             
         EJECT                                                                  
         IHAASXB DSECT=YES,LIST=YES                                             
         END                                                                    

