*************************************************
* FILENAME : LA00.asm
* AUTHOR : HYUK KIM
* SYSTEM : OFASM v4 revision 169
*************************************************
                MACRO
                MACRO_LA    &VALUE1,&VALUE2
                LG          2,&VALUE1
                LG          3,&VALUE2
                OFADBGREG   2
                OFADBGREG   3
                LA          2,0(0,3)
                OFADBGREG   2
                OFADBGREG   3
                MEND
LA00            CSECT
                LR          12,15
                USING       LA00,12
* 0		16bits	0	16bits
                MACRO_LA    DATA1_1,DATA1_2
* 0		16bits	0<	16bits
                MACRO_LA    DATA2_1,DATA2_2
* 0		16bits	0>	16bits
                MACRO_LA    DATA3_1,DATA3_2
* 0		32bits	0	32bits
                MACRO_LA    DATA4_1,DATA4_2
* 0		32bits	0<	32bits
                MACRO_LA    DATA5_1,DATA5_2
* 0		32bits	0>	32bits
                MACRO_LA    DATA6_1,DATA6_2
* 0		64bits	0	64bits
                MACRO_LA    DATA7_1,DATA7_2
* 0		64bits	0<	64bits
                MACRO_LA    DATA8_1,DATA8_2
* 0		64bits	0>	64bits
                MACRO_LA    DATA9_1,DATA9_2
* 0<	16bits	0	16bits
                MACRO_LA    DATA10_1,DATA10_2
* 0<	16bits	0<	16bits
                MACRO_LA    DATA11_1,DATA11_2
* 0<	16bits	0>	16bits
                MACRO_LA    DATA12_1,DATA12_2
* 0<	32bits	0	32bits
                MACRO_LA    DATA13_1,DATA13_2
* 0<	32bits	0<	32bits
                MACRO_LA    DATA14_1,DATA14_2
* 0<	32bits	0>	32bits
                MACRO_LA    DATA15_1,DATA15_2
* 0<	64bits	0	64bits
                MACRO_LA    DATA16_1,DATA16_2
* 0<	64bits	0<	64bits
                MACRO_LA    DATA17_1,DATA17_2
* 0<	64bits	0>	64bits
                MACRO_LA    DATA18_1,DATA18_2
* 0>	16bits	0	16bits
                MACRO_LA    DATA19_1,DATA19_2
* 0>	16bits	0<	16bits
                MACRO_LA    DATA20_1,DATA20_2
* 0>	16bits	0>	16bits
                MACRO_LA    DATA21_1,DATA21_2
* 0>	32bits	0	32bits
                MACRO_LA    DATA22_1,DATA22_2
* 0>	32bits	0<	32bits
                MACRO_LA    DATA23_1,DATA23_2
* 0>	32bits	0>	32bits
                MACRO_LA    DATA24_1,DATA24_2
* 0>	64bits	0	64bits
                MACRO_LA    DATA25_1,DATA25_2
* 0>	64bits	0<	64bits
                MACRO_LA    DATA26_1,DATA26_2
* 0>	64bits	0>	64bits
                MACRO_LA    DATA27_1,DATA27_2
                BR          14
                END
DATA1_1 DC X'FFFFFFFFFFFF0000'
DATA1_2 DC X'FFFFFFFFFFFF0000'
DATA2_1 DC X'FFFFFFFFFFFF0000'
DATA2_2 DC X'FFFFFFFFFFFF5678'
DATA3_1 DC X'FFFFFFFFFFFF0000'
DATA3_2 DC X'FFFFFFFFFFFFFF00'
DATA4_1 DC X'FFFFFFFF00000000'
DATA4_2 DC X'FFFFFFFF00000000'
DATA5_1 DC X'FFFFFFFF00000000'
DATA5_2 DC X'FFFFFFFF2468ACE0'
DATA6_1 DC X'FFFFFFFF00000000'
DATA6_2 DC X'FFFFFFFFFF000000'
DATA7_1 DC X'0000000000000000'
DATA7_2 DC X'0000000000000000'
DATA8_1 DC X'0000000000000000'
DATA8_2 DC X'0FEDCBA987654321'
DATA9_1 DC X'0000000000000000'
DATA9_2 DC X'FF00FF00FF00FF00'
DATA10_1 DC X'FFFFFFFFFFFF1234'
DATA10_2 DC X'FFFFFFFFFFFF0000'
DATA11_1 DC X'FFFFFFFFFFFF1234'
DATA11_2 DC X'FFFFFFFFFFFF5678'
DATA12_1 DC X'FFFFFFFFFFFF1234'
DATA12_2 DC X'FFFFFFFFFFFFF000'
DATA13_1 DC X'FFFFFFFF12345678'
DATA13_2 DC X'FFFFFFFF00000000'
DATA14_1 DC X'FFFFFFFF12345678'
DATA14_2 DC X'FFFFFFFF2468ACE0'
DATA15_1 DC X'FFFFFFFF12345678'
DATA15_2 DC X'FFFFFFFFFF000000'
DATA16_1 DC X'0123456789ABCDEF'
DATA16_2 DC X'0000000000000000'
DATA17_1 DC X'0123456789ABCDEF'
DATA17_2 DC X'0FEDCBA987654321'
DATA18_1 DC X'0123456789ABCDEF'
DATA18_2 DC X'FF00FF00FF00FF00'
DATA19_1 DC X'FFFFFFFFFFFFF000'
DATA19_2 DC X'FFFFFFFFFFFF0000'
DATA20_1 DC X'FFFFFFFFFFFFF000'
DATA20_2 DC X'FFFFFFFFFFFF5678'
DATA21_1 DC X'FFFFFFFFFFFFF000'
DATA21_2 DC X'FFFFFFFFFFFFFF00'
DATA22_1 DC X'FFFFFFFFF0000000'
DATA22_2 DC X'FFFFFFFF00000000'
DATA23_1 DC X'FFFFFFFFF0000000'
DATA23_2 DC X'FFFFFFFF2468ACE0'
DATA24_1 DC X'FFFFFFFFF0000000'
DATA24_2 DC X'FFFFFFFFFF000000'
DATA25_1 DC X'F000000000000000'
DATA25_2 DC X'0000000000000000'
DATA26_1 DC X'F000000000000000'
DATA26_2 DC X'0FEDCBA987654321'
DATA27_1 DC X'F000000000000000'
DATA27_2 DC X'FF00FF00FF00FF00'
