*************************************************
* FILENAME : D01.asm
* AUTHOR : HYUK KIM
* SYSTEM : OFASM v4 revision 169
*************************************************
                MACRO
                MACRO_D     &VALUE1,&VALUE2,&REGNO
                LG          &REGNO,DATA_INIT_REG
                LG          &REGNO+1,DATA_INIT_REG
                L           &REGNO,&VALUE1
                L           &REGNO+1,&VALUE1+4
                OFADBGREG   &REGNO
                OFADBGREG   &REGNO+1
                OFADBGMEM   &VALUE2,0
                D           &REGNO,&VALUE2
                OFADBGREG   &REGNO
                OFADBGREG   &REGNO+1
                OFADBGMEM   &VALUE2,0
                MEND
D01             CSECT
                LR          12,15
                USING       D01,12
* TESTCASE_46	0<	64bits	0	32bits>
                MACRO_D     DATA46_1,DATA46_2,2
* TESTCASE_47	0<	64bits	0	32bits
*                MACRO_D     DATA47_1,DATA47_2,2
* TESTCASE_48	0<	64bits	0	32bits<
*                MACRO_D     DATA48_1,DATA48_2,2
* TESTCASE_49	0<	64bits	0<	32bits>
                MACRO_D     DATA49_1,DATA49_2,2
* TESTCASE_50	0<	64bits	0<	32bits
                MACRO_D     DATA50_1,DATA50_2,2
* TESTCASE_51	0<	64bits	0<	32bits<
                MACRO_D     DATA51_1,DATA51_2,2
* TESTCASE_52	0<	64bits	0>	32bits>
                MACRO_D     DATA52_1,DATA52_2,2
* TESTCASE_53	0<	64bits	0>	32bits
                MACRO_D     DATA53_1,DATA53_2,2
* TESTCASE_54	0<	64bits	0>	32bits<
                MACRO_D     DATA54_1,DATA54_2,2
* TESTCASE_55	0>	16bits	0	32bits>
                MACRO_D     DATA55_1,DATA55_2,2
* TESTCASE_56	0>	16bits	0	32bits
*                MACRO_D     DATA56_1,DATA56_2,2
* TESTCASE_57	0>	16bits	0	32bits<
*                MACRO_D     DATA57_1,DATA57_2,2
* TESTCASE_58	0>	16bits	0<	32bits>
                MACRO_D     DATA58_1,DATA58_2,2
* TESTCASE_59	0>	16bits	0<	32bits
                MACRO_D     DATA59_1,DATA59_2,2
* TESTCASE_60	0>	16bits	0<	32bits<
                MACRO_D     DATA60_1,DATA60_2,2
* TESTCASE_61	0>	16bits	0>	32bits>
                MACRO_D     DATA61_1,DATA61_2,2
* TESTCASE_62	0>	16bits	0>	32bits
                MACRO_D     DATA62_1,DATA62_2,2
* TESTCASE_63	0>	16bits	0>	32bits<
                MACRO_D     DATA63_1,DATA63_2,2
* TESTCASE_64	0>	32bits	0	32bits>
                MACRO_D     DATA64_1,DATA64_2,2
* TESTCASE_65	0>	32bits	0	32bits
*                MACRO_D     DATA65_1,DATA65_2,2
* TESTCASE_66	0>	32bits	0	32bits<
*                MACRO_D     DATA66_1,DATA66_2,2
* TESTCASE_67	0>	32bits	0<	32bits>
                MACRO_D     DATA67_1,DATA67_2,2
* TESTCASE_68	0>	32bits	0<	32bits
                MACRO_D     DATA68_1,DATA68_2,2
* TESTCASE_69	0>	32bits	0<	32bits<
                MACRO_D     DATA69_1,DATA69_2,2
* TESTCASE_70	0>	32bits	0>	32bits>
                MACRO_D     DATA70_1,DATA70_2,2
* TESTCASE_71	0>	32bits	0>	32bits
                MACRO_D     DATA71_1,DATA71_2,2
* TESTCASE_72	0>	32bits	0>	32bits<
                MACRO_D     DATA72_1,DATA72_2,2
* TESTCASE_73	0>	64bits	0	32bits>
                MACRO_D     DATA73_1,DATA73_2,2
* TESTCASE_74	0>	64bits	0	32bits
*                MACRO_D     DATA74_1,DATA74_2,2
* TESTCASE_75	0>	64bits	0	32bits<
*                MACRO_D     DATA75_1,DATA75_2,2
* TESTCASE_76	0>	64bits	0<	32bits>
                MACRO_D     DATA76_1,DATA76_2,2
* TESTCASE_77	0>	64bits	0<	32bits
                MACRO_D     DATA77_1,DATA77_2,2
* TESTCASE_78	0>	64bits	0<	32bits<
                MACRO_D     DATA78_1,DATA78_2,2
* TESTCASE_79	0>	64bits	0>	32bits>
                MACRO_D     DATA79_1,DATA79_2,2
* TESTCASE_80	0>	64bits	0>	32bits
                MACRO_D     DATA80_1,DATA80_2,2
* TESTCASE_81	0>	64bits	0>	32bits<
                MACRO_D     DATA81_1,DATA81_2,2
                BR          14
DATA_INIT_REG DC X'0416041600000000'
DATA46_1 DC X'7FFFFFFFFFFFFFFF'
DATA46_2 DC X'0000'
 DC X'0416'
DATA47_1 DC X'7FFFFFFFFFFFFFFF'
DATA47_2 DC X'00000000'
DATA48_1 DC X'7FFFFFFFFFFFFFFF'
DATA48_2 DC X'0000000000000000'
DATA49_1 DC X'7FFFFFFFFFFFFFFF'
DATA49_2 DC X'0002'
 DC X'0416'
DATA50_1 DC X'7FFFFFFFFFFFFFFF'
DATA50_2 DC X'00000002'
DATA51_1 DC X'7FFFFFFFFFFFFFFF'
DATA51_2 DC X'0000000200000002'
DATA52_1 DC X'7FFFFFFFFFFFFFFF'
DATA52_2 DC X'8002'
 DC X'0416'
DATA53_1 DC X'7FFFFFFFFFFFFFFF'
DATA53_2 DC X'80000002'
DATA54_1 DC X'7FFFFFFFFFFFFFFF'
DATA54_2 DC X'8000000000000002'
DATA55_1 DC X'FEDCBA9876548000'
DATA55_2 DC X'0000'
 DC X'0416'
DATA56_1 DC X'FEDCBA9876548000'
DATA56_2 DC X'00000000'
DATA57_1 DC X'FEDCBA9876548000'
DATA57_2 DC X'0000000000000000'
DATA58_1 DC X'FEDCBA9876548000'
DATA58_2 DC X'0002'
 DC X'0416'
DATA59_1 DC X'FEDCBA9876548000'
DATA59_2 DC X'00000002'
DATA60_1 DC X'FEDCBA9876548000'
DATA60_2 DC X'0000000200000002'
DATA61_1 DC X'FEDCBA9876548000'
DATA61_2 DC X'8002'
 DC X'0416'
DATA62_1 DC X'FEDCBA9876548000'
DATA62_2 DC X'80000002'
DATA63_1 DC X'FEDCBA9876548000'
DATA63_2 DC X'8000000000000002'
DATA64_1 DC X'FEDCBA9880000000'
DATA64_2 DC X'0000'
 DC X'0416'
DATA65_1 DC X'FEDCBA9880000000'
DATA65_2 DC X'00000000'
DATA66_1 DC X'FEDCBA9880000000'
DATA66_2 DC X'0000000000000000'
DATA67_1 DC X'FEDCBA9880000000'
DATA67_2 DC X'0002'
 DC X'0416'
DATA68_1 DC X'FEDCBA9880000000'
DATA68_2 DC X'00000002'
DATA69_1 DC X'FEDCBA9880000000'
DATA69_2 DC X'0000000200000002'
DATA70_1 DC X'FEDCBA9880000000'
DATA70_2 DC X'8002'
 DC X'0416'
DATA71_1 DC X'FEDCBA9880000000'
DATA71_2 DC X'80000002'
DATA72_1 DC X'FEDCBA9880000000'
DATA72_2 DC X'8000000000000002'
DATA73_1 DC X'8000000000000000'
DATA73_2 DC X'0000'
 DC X'0416'
DATA74_1 DC X'8000000000000000'
DATA74_2 DC X'00000000'
DATA75_1 DC X'8000000000000000'
DATA75_2 DC X'0000000000000000'
DATA76_1 DC X'8000000000000000'
DATA76_2 DC X'0002'
 DC X'0416'
DATA77_1 DC X'8000000000000000'
DATA77_2 DC X'00000002'
DATA78_1 DC X'8000000000000000'
DATA78_2 DC X'0000000200000002'
DATA79_1 DC X'8000000000000000'
DATA79_2 DC X'8002'
 DC X'0416'
DATA80_1 DC X'8000000000000000'
DATA80_2 DC X'80000002'
DATA81_1 DC X'8000000000000000'
DATA81_2 DC X'8000000000000002'
                END
