LM01       CSECT
           LR        12,15
           USING     LM01,12
           LA        13,DATA
           LM        15,11,0(13)
           LA        1,WTO#L
           ST        15,WTO#DATA
           SVC       35
           ST        0,WTO#DATA
           SVC       35
           ST        2,WTO#DATA
           SVC       35
           ST        3,WTO#DATA
           SVC       35
           ST        4,WTO#DATA
           SVC       35
           ST        5,WTO#DATA
           SVC       35
           ST        6,WTO#DATA
           SVC       35
           ST        7,WTO#DATA
           SVC       35
           ST        8,WTO#DATA
           SVC       35
           ST        9,WTO#DATA
           SVC       35
           ST        10,WTO#DATA
           SVC       35
           ST        11,WTO#DATA
           SVC       35
           BR        14
DATA       DC        CL4'AAAA'
           DC        CL4'BBBB'
           DC        CL4'CCCC'
           DC        CL4'DDDD'
           DC        CL4'EEEE'
           DC        CL4'FFFF'
           DC        CL4'GGGG'
           DC        CL4'HHHH'
           DC        CL4'IIII'
           DC        CL4'JJJJ'
           DC        CL4'KKKK'
           DC        CL4'LLLL'
           DC        CL4'MMMM'
           DC        CL4'NNNN'
           DC        CL4'OOOO'
           DC        CL4'PPPP'
           DC        CL4'QQQQ'
           DC        CL4'RRRR'
WTO#L      DC        AL2(8)
           DC        B'0000000000000000'
WTO#DATA   DC        CL4'    '
           END
