*************************************************
* FILENAME : CH00.asm
* AUTHOR : HYUK KIM
* SYSTEM : OFASM v4 revision 169
*************************************************
        MACRO
        MACRO_CH    &VALUE1,&VALUE2
        LG          2,&VALUE1
        OFADBGREG   2
        OFADBGMEM   &VALUE2,0
        CH          2,&VALUE2
        OFADBGREG   2
        OFADBGMEM   &VALUE2,0
        MEND
CH00    CSECT
        LR          12,15
        USING       CH00,12
* TESTCASE_1	0	16bits	0	16bits>	oprand1=oprand2
                MACRO_CH    DATA1_1,DATA1_2
* TESTCASE_4	0	16bits	0	16bits	oprand1=oprand2
                MACRO_CH    DATA2_1,DATA2_2
* TESTCASE_7	0	16bits	0	16bits<	oprand1=oprand2
                MACRO_CH    DATA3_1,DATA3_2
* TESTCASE_11	0	16bits	0<	16bits>	oprand1<oprand2
                MACRO_CH    DATA4_1,DATA4_2
* TESTCASE_14	0	16bits	0<	16bits	oprand1<oprand2
                MACRO_CH    DATA5_1,DATA5_2
* TESTCASE_17	0	16bits	0<	16bits<	oprand1<oprand2
                MACRO_CH    DATA6_1,DATA6_2
* TESTCASE_21	0	16bits	0>	16bits>	oprand1>oprand2
                MACRO_CH    DATA7_1,DATA7_2
* TESTCASE_24	0	16bits	0>	16bits	oprand1>oprand2
                MACRO_CH    DATA8_1,DATA8_2
* TESTCASE_27	0	16bits	0>	16bits<	oprand1>oprand2
                MACRO_CH    DATA9_1,DATA9_2
* TESTCASE_28	0	32bits	0	16bits>	oprand1=oprand2
                MACRO_CH    DATA10_1,DATA10_2
* TESTCASE_31	0	32bits	0	16bits	oprand1=oprand2
                MACRO_CH    DATA11_1,DATA11_2
* TESTCASE_34	0	32bits	0	16bits<	oprand1=oprand2
                MACRO_CH    DATA12_1,DATA12_2
* TESTCASE_38	0	32bits	0<	16bits>	oprand1<oprand2
                MACRO_CH    DATA13_1,DATA13_2
* TESTCASE_41	0	32bits	0<	16bits	oprand1<oprand2
                MACRO_CH    DATA14_1,DATA14_2
* TESTCASE_44	0	32bits	0<	16bits<	oprand1<oprand2
                MACRO_CH    DATA15_1,DATA15_2
* TESTCASE_48	0	32bits	0>	16bits>	oprand1>oprand2
                MACRO_CH    DATA16_1,DATA16_2
* TESTCASE_51	0	32bits	0>	16bits	oprand1>oprand2
                MACRO_CH    DATA17_1,DATA17_2
* TESTCASE_54	0	32bits	0>	16bits<	oprand1>oprand2
                MACRO_CH    DATA18_1,DATA18_2
* TESTCASE_55	0	64bits	0	16bits>	oprand1=oprand2
                MACRO_CH    DATA19_1,DATA19_2
* TESTCASE_58	0	64bits	0	16bits	oprand1=oprand2
                MACRO_CH    DATA20_1,DATA20_2
* TESTCASE_61	0	64bits	0	16bits<	oprand1=oprand2
                MACRO_CH    DATA21_1,DATA21_2
* TESTCASE_65	0	64bits	0<	16bits>	oprand1<oprand2
                MACRO_CH    DATA22_1,DATA22_2
* TESTCASE_68	0	64bits	0<	16bits	oprand1<oprand2
                MACRO_CH    DATA23_1,DATA23_2
* TESTCASE_71	0	64bits	0<	16bits<	oprand1<oprand2
                MACRO_CH    DATA24_1,DATA24_2
* TESTCASE_75	0	64bits	0>	16bits>	oprand1>oprand2
                MACRO_CH    DATA25_1,DATA25_2
* TESTCASE_78	0	64bits	0>	16bits	oprand1>oprand2
                MACRO_CH    DATA26_1,DATA26_2
* TESTCASE_81	0	64bits	0>	16bits<	oprand1>oprand2
                MACRO_CH    DATA27_1,DATA27_2
* TESTCASE_84	0<	16bits	0	16bits>	oprand1>oprand2
                MACRO_CH    DATA28_1,DATA28_2
* TESTCASE_87	0<	16bits	0	16bits	oprand1>oprand2
                MACRO_CH    DATA29_1,DATA29_2
* TESTCASE_90	0<	16bits	0	16bits<	oprand1>oprand2
                MACRO_CH    DATA30_1,DATA30_2
* TESTCASE_91	0<	16bits	0<	16bits>	oprand1=oprand2
                MACRO_CH    DATA31_1,DATA31_2
* TESTCASE_92	0<	16bits	0<	16bits>	oprand1<oprand2
                MACRO_CH    DATA32_1,DATA32_2
* TESTCASE_93	0<	16bits	0<	16bits>	oprand1>oprand2
                MACRO_CH    DATA33_1,DATA33_2
* TESTCASE_94	0<	16bits	0<	16bits	oprand1=oprand2
                MACRO_CH    DATA34_1,DATA34_2
* TESTCASE_95	0<	16bits	0<	16bits	oprand1<oprand2
                MACRO_CH    DATA35_1,DATA35_2
* TESTCASE_96	0<	16bits	0<	16bits	oprand1>oprand2
                MACRO_CH    DATA36_1,DATA36_2
* TESTCASE_97	0<	16bits	0<	16bits<	oprand1=oprand2
                MACRO_CH    DATA37_1,DATA37_2
* TESTCASE_98	0<	16bits	0<	16bits<	oprand1<oprand2
                MACRO_CH    DATA38_1,DATA38_2
* TESTCASE_99	0<	16bits	0<	16bits<	oprand1>oprand2
                MACRO_CH    DATA39_1,DATA39_2
* TESTCASE_102	0<	16bits	0>	16bits>	oprand1>oprand2
                MACRO_CH    DATA40_1,DATA40_2
* TESTCASE_105	0<	16bits	0>	16bits	oprand1>oprand2
                MACRO_CH    DATA41_1,DATA41_2
* TESTCASE_108	0<	16bits	0>	16bits<	oprand1>oprand2
                MACRO_CH    DATA42_1,DATA42_2
* TESTCASE_111	0<	32bits	0	16bits>	oprand1>oprand2
                MACRO_CH    DATA43_1,DATA43_2
* TESTCASE_114	0<	32bits	0	16bits	oprand1>oprand2
                MACRO_CH    DATA44_1,DATA44_2
* TESTCASE_117	0<	32bits	0	16bits<	oprand1>oprand2
                MACRO_CH    DATA45_1,DATA45_2
* TESTCASE_118	0<	32bits	0<	16bits>	oprand1=oprand2
                MACRO_CH    DATA46_1,DATA46_2
* TESTCASE_119	0<	32bits	0<	16bits>	oprand1<oprand2
                MACRO_CH    DATA47_1,DATA47_2
* TESTCASE_120	0<	32bits	0<	16bits>	oprand1>oprand2
                MACRO_CH    DATA48_1,DATA48_2
* TESTCASE_121	0<	32bits	0<	16bits	oprand1=oprand2
                MACRO_CH    DATA49_1,DATA49_2
* TESTCASE_122	0<	32bits	0<	16bits	oprand1<oprand2
                MACRO_CH    DATA50_1,DATA50_2
* TESTCASE_123	0<	32bits	0<	16bits	oprand1>oprand2
                MACRO_CH    DATA51_1,DATA51_2
* TESTCASE_124	0<	32bits	0<	16bits<	oprand1=oprand2
                MACRO_CH    DATA52_1,DATA52_2
* TESTCASE_125	0<	32bits	0<	16bits<	oprand1<oprand2
                MACRO_CH    DATA53_1,DATA53_2
* TESTCASE_126	0<	32bits	0<	16bits<	oprand1>oprand2
                MACRO_CH    DATA54_1,DATA54_2
* TESTCASE_129	0<	32bits	0>	16bits>	oprand1>oprand2
                MACRO_CH    DATA55_1,DATA55_2
* TESTCASE_132	0<	32bits	0>	16bits	oprand1>oprand2
                MACRO_CH    DATA56_1,DATA56_2
* TESTCASE_135	0<	32bits	0>	16bits<	oprand1>oprand2
                MACRO_CH    DATA57_1,DATA57_2
* TESTCASE_138	0<	64bits	0	16bits>	oprand1>oprand2
                MACRO_CH    DATA58_1,DATA58_2
* TESTCASE_141	0<	64bits	0	16bits	oprand1>oprand2
                MACRO_CH    DATA59_1,DATA59_2
* TESTCASE_144	0<	64bits	0	16bits<	oprand1>oprand2
                MACRO_CH    DATA60_1,DATA60_2
* TESTCASE_145	0<	64bits	0<	16bits>	oprand1=oprand2
                MACRO_CH    DATA61_1,DATA61_2
* TESTCASE_146	0<	64bits	0<	16bits>	oprand1<oprand2
                MACRO_CH    DATA62_1,DATA62_2
* TESTCASE_147	0<	64bits	0<	16bits>	oprand1>oprand2
                MACRO_CH    DATA63_1,DATA63_2
* TESTCASE_148	0<	64bits	0<	16bits	oprand1=oprand2
                MACRO_CH    DATA64_1,DATA64_2
* TESTCASE_149	0<	64bits	0<	16bits	oprand1<oprand2
                MACRO_CH    DATA65_1,DATA65_2
* TESTCASE_150	0<	64bits	0<	16bits	oprand1>oprand2
                MACRO_CH    DATA66_1,DATA66_2
* TESTCASE_151	0<	64bits	0<	16bits<	oprand1=oprand2
                MACRO_CH    DATA67_1,DATA67_2
* TESTCASE_152	0<	64bits	0<	16bits<	oprand1<oprand2
                MACRO_CH    DATA68_1,DATA68_2
* TESTCASE_153	0<	64bits	0<	16bits<	oprand1>oprand2
                MACRO_CH    DATA69_1,DATA69_2
* TESTCASE_156	0<	64bits	0>	16bits>	oprand1>oprand2
                MACRO_CH    DATA70_1,DATA70_2
* TESTCASE_159	0<	64bits	0>	16bits	oprand1>oprand2
                MACRO_CH    DATA71_1,DATA71_2
* TESTCASE_162	0<	64bits	0>	16bits<	oprand1>oprand2
                MACRO_CH    DATA72_1,DATA72_2
* TESTCASE_164	0>	16bits	0	16bits>	oprand1<oprand2
                MACRO_CH    DATA73_1,DATA73_2
* TESTCASE_167	0>	16bits	0	16bits	oprand1<oprand2
                MACRO_CH    DATA74_1,DATA74_2
* TESTCASE_170	0>	16bits	0	16bits<	oprand1<oprand2
                MACRO_CH    DATA75_1,DATA75_2
* TESTCASE_173	0>	16bits	0<	16bits>	oprand1<oprand2
                MACRO_CH    DATA76_1,DATA76_2
* TESTCASE_176	0>	16bits	0<	16bits	oprand1<oprand2
                MACRO_CH    DATA77_1,DATA77_2
* TESTCASE_179	0>	16bits	0<	16bits<	oprand1<oprand2
                MACRO_CH    DATA78_1,DATA78_2
* TESTCASE_181	0>	16bits	0>	16bits>	oprand1=oprand2
                MACRO_CH    DATA79_1,DATA79_2
* TESTCASE_182	0>	16bits	0>	16bits>	oprand1<oprand2
                MACRO_CH    DATA80_1,DATA80_2
* TESTCASE_183	0>	16bits	0>	16bits>	oprand1>oprand2
                MACRO_CH    DATA81_1,DATA81_2
* TESTCASE_184	0>	16bits	0>	16bits	oprand1=oprand2
                MACRO_CH    DATA82_1,DATA82_2
* TESTCASE_185	0>	16bits	0>	16bits	oprand1<oprand2
                MACRO_CH    DATA83_1,DATA83_2
* TESTCASE_186	0>	16bits	0>	16bits	oprand1>oprand2
                MACRO_CH    DATA84_1,DATA84_2
* TESTCASE_187	0>	16bits	0>	16bits<	oprand1=oprand2
                MACRO_CH    DATA85_1,DATA85_2
* TESTCASE_188	0>	16bits	0>	16bits<	oprand1<oprand2
                MACRO_CH    DATA86_1,DATA86_2
* TESTCASE_189	0>	16bits	0>	16bits<	oprand1>oprand2
                MACRO_CH    DATA87_1,DATA87_2
* TESTCASE_191	0>	32bits	0	16bits>	oprand1<oprand2
                MACRO_CH    DATA88_1,DATA88_2
* TESTCASE_194	0>	32bits	0	16bits	oprand1<oprand2
                MACRO_CH    DATA89_1,DATA89_2
* TESTCASE_197	0>	32bits	0	16bits<	oprand1<oprand2
                MACRO_CH    DATA90_1,DATA90_2
* TESTCASE_200	0>	32bits	0<	16bits>	oprand1<oprand2
                MACRO_CH    DATA91_1,DATA91_2
* TESTCASE_203	0>	32bits	0<	16bits	oprand1<oprand2
                MACRO_CH    DATA92_1,DATA92_2
* TESTCASE_206	0>	32bits	0<	16bits<	oprand1<oprand2
                MACRO_CH    DATA93_1,DATA93_2
* TESTCASE_208	0>	32bits	0>	16bits>	oprand1=oprand2
                MACRO_CH    DATA94_1,DATA94_2
* TESTCASE_209	0>	32bits	0>	16bits>	oprand1<oprand2
                MACRO_CH    DATA95_1,DATA95_2
* TESTCASE_210	0>	32bits	0>	16bits>	oprand1>oprand2
                MACRO_CH    DATA96_1,DATA96_2
* TESTCASE_211	0>	32bits	0>	16bits	oprand1=oprand2
                MACRO_CH    DATA97_1,DATA97_2
* TESTCASE_212	0>	32bits	0>	16bits	oprand1<oprand2
                MACRO_CH    DATA98_1,DATA98_2
* TESTCASE_213	0>	32bits	0>	16bits	oprand1>oprand2
                MACRO_CH    DATA99_1,DATA99_2
* TESTCASE_214	0>	32bits	0>	16bits<	oprand1=oprand2
                MACRO_CH    DATA100_1,DATA100_2
        BR          14
DATA1_1 DC X'FFFFFFFFFFFF0000'
DATA1_2 DC X'00'
DATA1_TEMP DC X'FF'
DATA2_1 DC X'FFFFFFFFFFFF0000'
DATA2_2 DC X'0000'
DATA3_1 DC X'FFFFFFFFFFFF0000'
DATA3_2 DC X'00000000'
DATA4_1 DC X'FFFFFFFFFFFF0000'
DATA4_2 DC X'01'
DATA4_TEMP DC X'23'
DATA5_1 DC X'FFFFFFFFFFFF0000'
DATA5_2 DC X'0123'
DATA6_1 DC X'FFFFFFFFFFFF0000'
DATA6_2 DC X'01234567'
DATA7_1 DC X'FFFFFFFFFFFF0000'
DATA7_2 DC X'F0'
DATA7_TEMP DC X'12'
DATA8_1 DC X'FFFFFFFFFFFF0000'
DATA8_2 DC X'F012'
DATA9_1 DC X'FFFFFFFFFFFF0000'
DATA9_2 DC X'F0123456'
DATA10_1 DC X'FFFFFFFF00000000'
DATA10_2 DC X'00'
DATA10_TEMP DC X'FF'
DATA11_1 DC X'FFFFFFFF00000000'
DATA11_2 DC X'0000'
DATA12_1 DC X'FFFFFFFF00000000'
DATA12_2 DC X'00000000'
DATA13_1 DC X'FFFFFFFF00000000'
DATA13_2 DC X'01'
DATA13_TEMP DC X'23'
DATA14_1 DC X'FFFFFFFF00000000'
DATA14_2 DC X'0123'
DATA15_1 DC X'FFFFFFFF00000000'
DATA15_2 DC X'01234567'
DATA16_1 DC X'FFFFFFFF00000000'
DATA16_2 DC X'F0'
DATA16_TEMP DC X'12'
DATA17_1 DC X'FFFFFFFF00000000'
DATA17_2 DC X'F012'
DATA18_1 DC X'FFFFFFFF00000000'
DATA18_2 DC X'F0123456'
DATA19_1 DC X'0000000000000000'
DATA19_2 DC X'00'
DATA19_TEMP DC X'FF'
DATA20_1 DC X'0000000000000000'
DATA20_2 DC X'0000'
DATA21_1 DC X'0000000000000000'
DATA21_2 DC X'00000000'
DATA22_1 DC X'0000000000000000'
DATA22_2 DC X'01'
DATA22_TEMP DC X'23'
DATA23_1 DC X'0000000000000000'
DATA23_2 DC X'0123'
DATA24_1 DC X'0000000000000000'
DATA24_2 DC X'01234567'
DATA25_1 DC X'0000000000000000'
DATA25_2 DC X'F0'
DATA25_TEMP DC X'12'
DATA26_1 DC X'0000000000000000'
DATA26_2 DC X'F012'
DATA27_1 DC X'0000000000000000'
DATA27_2 DC X'F0123456'
DATA28_1 DC X'FFFFFFFFFFFF0123'
DATA28_2 DC X'00'
DATA28_TEMP DC X'FF'
DATA29_1 DC X'FFFFFFFFFFFF0123'
DATA29_2 DC X'0000'
DATA30_1 DC X'FFFFFFFFFFFF0123'
DATA30_2 DC X'00000000'
DATA31_1 DC X'FFFFFFFFFFFF0123'
DATA31_2 DC X'01'
DATA31_TEMP DC X'23'
DATA32_1 DC X'FFFFFFFFFFFF0123'
DATA32_2 DC X'01'
DATA32_TEMP DC X'23'
DATA33_1 DC X'FFFFFFFFFFFF0123'
DATA33_2 DC X'01'
DATA33_TEMP DC X'23'
DATA34_1 DC X'FFFFFFFFFFFF0123'
DATA34_2 DC X'0123'
DATA35_1 DC X'FFFFFFFFFFFF0123'
DATA35_2 DC X'0123'
DATA36_1 DC X'FFFFFFFFFFFF0123'
DATA36_2 DC X'0123'
DATA37_1 DC X'FFFFFFFFFFFF0123'
DATA37_2 DC X'01234567'
DATA38_1 DC X'FFFFFFFFFFFF0123'
DATA38_2 DC X'01234567'
DATA39_1 DC X'FFFFFFFFFFFF0123'
DATA39_2 DC X'01234567'
DATA40_1 DC X'FFFFFFFFFFFF0123'
DATA40_2 DC X'F0'
DATA40_TEMP DC X'12'
DATA41_1 DC X'FFFFFFFFFFFF0123'
DATA41_2 DC X'F012'
DATA42_1 DC X'FFFFFFFFFFFF0123'
DATA42_2 DC X'F0123456'
DATA43_1 DC X'FFFFFFFF01234567'
DATA43_2 DC X'00'
DATA43_TEMP DC X'FF'
DATA44_1 DC X'FFFFFFFF01234567'
DATA44_2 DC X'0000'
DATA45_1 DC X'FFFFFFFF01234567'
DATA45_2 DC X'00000000'
DATA46_1 DC X'FFFFFFFF01234567'
DATA46_2 DC X'01'
DATA46_TEMP DC X'23'
DATA47_1 DC X'FFFFFFFF01234567'
DATA47_2 DC X'01'
DATA47_TEMP DC X'23'
DATA48_1 DC X'FFFFFFFF01234567'
DATA48_2 DC X'01'
DATA48_TEMP DC X'23'
DATA49_1 DC X'FFFFFFFF01234567'
DATA49_2 DC X'0123'
DATA50_1 DC X'FFFFFFFF01234567'
DATA50_2 DC X'0123'
DATA51_1 DC X'FFFFFFFF01234567'
DATA51_2 DC X'0123'
DATA52_1 DC X'FFFFFFFF01234567'
DATA52_2 DC X'01234567'
DATA53_1 DC X'FFFFFFFF01234567'
DATA53_2 DC X'01234567'
DATA54_1 DC X'FFFFFFFF01234567'
DATA54_2 DC X'01234567'
DATA55_1 DC X'FFFFFFFF01234567'
DATA55_2 DC X'F0'
DATA55_TEMP DC X'12'
DATA56_1 DC X'FFFFFFFF01234567'
DATA56_2 DC X'F012'
DATA57_1 DC X'FFFFFFFF01234567'
DATA57_2 DC X'F0123456'
DATA58_1 DC X'0123456789ABCDEF'
DATA58_2 DC X'00'
DATA58_TEMP DC X'FF'
DATA59_1 DC X'0123456789ABCDEF'
DATA59_2 DC X'0000'
DATA60_1 DC X'0123456789ABCDEF'
DATA60_2 DC X'00000000'
DATA61_1 DC X'0123456789ABCDEF'
DATA61_2 DC X'01'
DATA61_TEMP DC X'23'
DATA62_1 DC X'0123456789ABCDEF'
DATA62_2 DC X'01'
DATA62_TEMP DC X'23'
DATA63_1 DC X'0123456789ABCDEF'
DATA63_2 DC X'01'
DATA63_TEMP DC X'23'
DATA64_1 DC X'0123456789ABCDEF'
DATA64_2 DC X'0123'
DATA65_1 DC X'0123456789ABCDEF'
DATA65_2 DC X'0123'
DATA66_1 DC X'0123456789ABCDEF'
DATA66_2 DC X'0123'
DATA67_1 DC X'0123456789ABCDEF'
DATA67_2 DC X'01234567'
DATA68_1 DC X'0123456789ABCDEF'
DATA68_2 DC X'01234567'
DATA69_1 DC X'0123456789ABCDEF'
DATA69_2 DC X'01234567'
DATA70_1 DC X'0123456789ABCDEF'
DATA70_2 DC X'F0'
DATA70_TEMP DC X'12'
DATA71_1 DC X'0123456789ABCDEF'
DATA71_2 DC X'F012'
DATA72_1 DC X'0123456789ABCDEF'
DATA72_2 DC X'F0123456'
DATA73_1 DC X'012345670123F012'
DATA73_2 DC X'00'
DATA73_TEMP DC X'FF'
DATA74_1 DC X'012345670123F012'
DATA74_2 DC X'0000'
DATA75_1 DC X'012345670123F012'
DATA75_2 DC X'00000000'
DATA76_1 DC X'012345670123F012'
DATA76_2 DC X'01'
DATA76_TEMP DC X'23'
DATA77_1 DC X'012345670123F012'
DATA77_2 DC X'0123'
DATA78_1 DC X'012345670123F012'
DATA78_2 DC X'01234567'
DATA79_1 DC X'012345670123F012'
DATA79_2 DC X'F0'
DATA79_TEMP DC X'12'
DATA80_1 DC X'012345670123F012'
DATA80_2 DC X'F0'
DATA80_TEMP DC X'12'
DATA81_1 DC X'012345670123F012'
DATA81_2 DC X'F0'
DATA81_TEMP DC X'12'
DATA82_1 DC X'012345670123F012'
DATA82_2 DC X'F012'
DATA83_1 DC X'012345670123F012'
DATA83_2 DC X'F012'
DATA84_1 DC X'012345670123F012'
DATA84_2 DC X'F012'
DATA85_1 DC X'012345670123F012'
DATA85_2 DC X'F0123456'
DATA86_1 DC X'012345670123F012'
DATA86_2 DC X'F0123456'
DATA87_1 DC X'012345670123F012'
DATA87_2 DC X'F0123456'
DATA88_1 DC X'01234567F0123456'
DATA88_2 DC X'00'
DATA88_TEMP DC X'FF'
DATA89_1 DC X'01234567F0123456'
DATA89_2 DC X'0000'
DATA90_1 DC X'01234567F0123456'
DATA90_2 DC X'00000000'
DATA91_1 DC X'01234567F0123456'
DATA91_2 DC X'01'
DATA91_TEMP DC X'23'
DATA92_1 DC X'01234567F0123456'
DATA92_2 DC X'0123'
DATA93_1 DC X'01234567F0123456'
DATA93_2 DC X'01234567'
DATA94_1 DC X'01234567F0123456'
DATA94_2 DC X'F0'
DATA94_TEMP DC X'12'
DATA95_1 DC X'01234567F0123456'
DATA95_2 DC X'F0'
DATA95_TEMP DC X'12'
DATA96_1 DC X'01234567F0123456'
DATA96_2 DC X'F0'
DATA96_TEMP DC X'12'
DATA97_1 DC X'01234567F0123456'
DATA97_2 DC X'F012'
DATA98_1 DC X'01234567F0123456'
DATA98_2 DC X'F012'
DATA99_1 DC X'01234567F0123456'
DATA99_2 DC X'F012'
DATA100_1 DC X'01234567F0123456'
DATA100_2 DC X'F0123456'
        END
