*************************************************
* FILENAME : CLST00.asm
* AUTHOR : HYUK KIM
* SYSTEM : OFASM v4 revision 169
*************************************************
        MACRO
        MACRO_CLST  &VALUE1,&VALUE2
        LA          2,&VALUE1
        LA          3,&VALUE2
        LR          4,2
        LR          5,3
        CLST        2,3
        LA          6,0
        OFADBGREG   6
        SR          2,4
        SR          3,5
        OFADBGREG   2
        OFADBGREG   3
        MEND
CLST00  CSECT
        LR          12,15
        USING       CLST00,12
* TESTCASE_1 op1 length=op2 length oprand1=oprand2
                MACRO_CLST  DATA1_1,DATA1_2
* TESTCASE_2 op1 length=op2 length oprand1<oprand2
                MACRO_CLST  DATA2_1,DATA2_2
* TESTCASE_3 op1 length=op2 length oprand1>oprand2
                MACRO_CLST  DATA3_1,DATA3_2
* TESTCASE_4 op1 length=op2 length cpu-determined equal
                MACRO_CLST  DATA4_1,DATA4_2
* TESTCASE_9 op1 length>op2 length longer op oprand1=oprand2
                MACRO_CLST  DATA5_1,DATA5_2
* TESTCASE_10 op1 length>op2 length longer op oprand1<oprand2
                MACRO_CLST  DATA6_1,DATA6_2
* TESTCASE_11 op1 length>op2 length longer op oprand1>oprand2
                MACRO_CLST  DATA7_1,DATA7_2
* TESTCASE_12 op1 length>op2 length longer op cpu-determined equal
                MACRO_CLST  DATA8_1,DATA8_2
* TESTCASE_13 op1 length>op2 length shorter op oprand1=oprand2
                MACRO_CLST  DATA9_1,DATA9_2
* TESTCASE_14 op1 length>op2 length shorter op oprand1<oprand2
                MACRO_CLST  DATA10_1,DATA10_2
* TESTCASE_15 op1 length>op2 length shorter op oprand1>oprand2
                MACRO_CLST  DATA11_1,DATA11_2
* TESTCASE_16 op1 length>op2 length shorter op cpu-determined equal
                MACRO_CLST  DATA12_1,DATA12_2
* TESTCASE_17 op1 length<op2 length longer op oprand1=oprand2
                MACRO_CLST  DATA13_1,DATA13_2
* TESTCASE_18 op1 length<op2 length longer op oprand1<oprand2
                MACRO_CLST  DATA14_1,DATA14_2
* TESTCASE_19 op1 length<op2 length longer op oprand1>oprand2
                MACRO_CLST  DATA15_1,DATA15_2
* TESTCASE_20 op1 length<op2 length longer op cpu-determined equal
                MACRO_CLST  DATA16_1,DATA16_2
* TESTCASE_21 op1 length<op2 length shorter op oprand1=oprand2
                MACRO_CLST  DATA17_1,DATA17_2
* TESTCASE_22 op1 length<op2 length shorter op oprand1<oprand2
                MACRO_CLST  DATA18_1,DATA18_2
* TESTCASE_23 op1 length<op2 length shorter op oprand1>oprand2
                MACRO_CLST  DATA19_1,DATA19_2
* TESTCASE_24 op1 length<op2 length shorter op cpu-determined equal
                MACRO_CLST  DATA20_1,DATA20_2
        BR          14
DATA1_1 DC X'0123456789ABCDEF00'
DATA1_2 DC X'0123456789ABCDEF00'
DATA2_1 DC X'0123456789ABCDEE00'
DATA2_2 DC X'0123456789ABCDEF00'
DATA3_1 DC X'0123456789ABCDEF00'
DATA3_2 DC X'0123456789ABCDEE00'
DATA4_1 DC 0XL257
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'01'
DATA4_2 DC 0XL257
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'02'
DATA5_1 DC X'0123456789ABCDEF00'
DATA5_2 DC X'0123456700'
DATA6_1 DC X'0123456789ABCDEF00'
DATA6_2 DC X'0123456700'
DATA7_1 DC X'0123456789ABCDEF00'
DATA7_2 DC X'0123456700'
DATA8_1 DC 0XL257
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'01'
DATA8_2 DC 0XL257
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'02'
DATA9_1 DC X'0123456789ABCDEF00'
DATA9_2 DC X'0123456700'
DATA10_1 DC X'0123456689ABCDEF00'
DATA10_2 DC X'0123456700'
DATA11_1 DC X'0123456889ABCDEF00'
DATA11_2 DC X'0123456700'
DATA12_1 DC 0XL257
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'01'
DATA12_2 DC X'0123456789ABCDEF00'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'02'
DATA13_1 DC X'0123456700'
DATA13_2 DC X'0123456789ABCDEF00'
DATA14_1 DC X'0123456600'
DATA14_2 DC X'0123456789ABCDEF00'
DATA15_1 DC X'0123456800'
DATA15_2 DC X'0123456789ABCDEF00'
DATA16_1 DC X'0123456789ABCDEF00'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'01'
DATA16_2 DC 0XL257
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'02'
DATA17_1 DC X'0123456700'
DATA17_2 DC X'0123456789ABCDEF00'
DATA18_1 DC X'0123456600'
DATA18_2 DC X'0123456789ABCDEF00'
DATA19_1 DC X'0123456800'
DATA19_2 DC X'0123456789ABCDEF00'
DATA20_1 DC X'0123456789ABCDEF00'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'01'
DATA20_2 DC 0XL257
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'0123456789ABCDEF'
 DC X'02'
        END
