*************************************************
* FILENAME : SLDA00.asm
* AUTHOR : HYUK KIM
* SYSTEM : OFASM v4 revision 258 
*************************************************
                MACRO
                MACRO_SLDA  &REGNUM,&VALUE,&NUM
                LG          &REGNUM,REG_INIT
                LG          &REGNUM+1,REG_INIT
                L           &REGNUM,&VALUE
                L           &REGNUM+1,&VALUE+4
                OFADBGREG   &REGNUM
                OFADBGREG   &REGNUM+1
                SLDA        &REGNUM,&NUM
                OFADBGREG   &REGNUM
                OFADBGREG   &REGNUM+1
                MEND
SLDA00          CSECT
                LR          12,15
                USING       SLDA00,12
* TESTCASE_1	invalid Rn	ERROR
*                MACRO_SLDA  DATA1_REGNUM,DATA1_1,DATA1_2
* TESTCASE_25	even Rn	0	0~64	zero
                MACRO_SLDA  DATA2_REGNUM,DATA2_1,DATA2_2
* TESTCASE_29	even Rn	0	64<	zero
                MACRO_SLDA  DATA3_REGNUM,DATA3_1,DATA3_2
* TESTCASE_35	even Rn	0<	0~64	zero<
                MACRO_SLDA  DATA4_REGNUM,DATA4_1,DATA4_2
* TESTCASE_36	even Rn	0<	0~64	overflow
                MACRO_SLDA  DATA5_REGNUM,DATA5_1,DATA5_2
* TESTCASE_39	even Rn	0<	64<	zero<
                MACRO_SLDA  DATA6_REGNUM,DATA6_1,DATA6_2
* TESTCASE_40	even Rn	0<	64<	overflow
                MACRO_SLDA  DATA7_REGNUM,DATA7_1,DATA7_2
* TESTCASE_42	even Rn	0>	0~64	zero>
                MACRO_SLDA  DATA8_REGNUM,DATA8_1,DATA8_2
* TESTCASE_44	even Rn	0>	0~64	overflow
                MACRO_SLDA  DATA9_REGNUM,DATA9_1,DATA9_2
* TESTCASE_46	even Rn	0>	64<	zero>
                MACRO_SLDA  DATA10_REGNUM,DATA10_1,DATA10_2
* TESTCASE_48	even Rn	0>	64<	overflow
                MACRO_SLDA  DATA11_REGNUM,DATA11_1,DATA11_2
* TESTCASE_49	odd Rn	ERROR
*                MACRO_SLDA  DATA12_REGNUM,DATA12_1,DATA12_2
                BR          14
REG_INIT DC X'0416041600000000'
DATA1_REGNUM EQU 16
DATA1_1 DC X'0000000000000000'
DATA1_2 EQU 32
DATA2_REGNUM EQU 2
DATA2_1 DC X'0000000000000000'
DATA2_2 EQU 32
DATA3_REGNUM EQU 4
DATA3_1 DC X'0000000000000000'
DATA3_2 EQU 96
DATA4_REGNUM EQU 6
DATA4_1 DC X'0000000040000000'
DATA4_2 EQU 32
DATA5_REGNUM EQU 8
DATA5_1 DC X'0000000080000000'
DATA5_2 EQU 32
DATA6_REGNUM EQU 10
DATA6_1 DC X'0000000040000000'
DATA6_2 EQU 96
DATA7_REGNUM EQU 2
DATA7_1 DC X'0000000080000000'
DATA7_2 EQU 96
DATA8_REGNUM EQU 2
DATA8_1 DC X'FFFFFFFF80000000'
DATA8_2 EQU 32
DATA9_REGNUM EQU 2
DATA9_1 DC X'FFFFFFFF40000000'
DATA9_2 EQU 32
DATA10_REGNUM EQU 2
DATA10_1 DC X'FFFFFFFF80000000'
DATA10_2 EQU 96
DATA11_REGNUM EQU 2
DATA11_1 DC X'FFFFFFFF40000000'
DATA11_2 EQU 96
DATA12_REGNUM EQU 3
DATA12_1 DC X'0000000000000000'
DATA12_2 EQU 32
                END
